<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Carbon;

class ArticlesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [

            [
                'title'     => 'Это может быть любой заголовок.',
                'text'    => "<p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?
                                  В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?
                                        </p>
                                        <p> В Интернете полно догматических заповедей о том, как нуж Иногда  переходят в холивары: использовать естественные
                                  или искусственные ключи? АвтоинкрементнD?
                                  В Интернете полно догльзовать
                                 ключи в реляционных базах данных. Иногда сподят в холивары: использовать естественные
                                  или искусственные ключи? Авментные целые или UUID?</p>
                                        <p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных.же переходят в холивары: использовать естественные
                                  или искусственные ключи? даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?</p>
                                        <p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? или UUID?
                                  В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базахры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?</p>",
                'created_at' => new Carbon(date("Y-m-d", time())),
            ],
            [
                'title'     => 'Это может быть любой заголовок.',
                'text'    => "<p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?
                                  В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?
                                        </p>
                                        <p> В Интернете полно догматических заповедей о том, как нуж Иногда  переходят в холивары: использовать естественные
                                  или искусственные ключи? АвтоинкрементнD?
                                  В Интернете полно догльзовать
                                 ключи в реляционных базах данных. Иногда сподят в холивары: использовать естественные
                                  или искусственные ключи? Авментные целые или UUID?</p>
                                        <p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных.же переходят в холивары: использовать естественные
                                  или искусственные ключи? даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?</p>
                                        <p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? или UUID?
                                  В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базахры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?</p>",
                'created_at' => new Carbon(date("Y-m-d", time())),
            ],
            [
                'title'     => 'Это может быть любой заголовок.',
                'text'    => "<p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?
                                  В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?
                                        </p>
                                        <p> В Интернете полно догматических заповедей о том, как нуж Иногда  переходят в холивары: использовать естественные
                                  или искусственные ключи? АвтоинкрементнD?
                                  В Интернете полно догльзовать
                                 ключи в реляционных базах данных. Иногда сподят в холивары: использовать естественные
                                  или искусственные ключи? Авментные целые или UUID?</p>
                                        <p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных.же переходят в холивары: использовать естественные
                                  или искусственные ключи? даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?</p>
                                        <p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? или UUID?
                                  В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базахры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?</p>",
                'created_at' => new Carbon(date("Y-m-d", time())),
            ],
            [
                'title'     => 'Это может быть любой заголовок.',
                'text'    => "<p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?
                                  В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?
                                        </p>
                                        <p> В Интернете полно догматических заповедей о том, как нуж Иногда  переходят в холивары: использовать естественные
                                  или искусственные ключи? АвтоинкрементнD?
                                  В Интернете полно догльзовать
                                 ключи в реляционных базах данных. Иногда сподят в холивары: использовать естественные
                                  или искусственные ключи? Авментные целые или UUID?</p>
                                        <p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных.же переходят в холивары: использовать естественные
                                  или искусственные ключи? даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?</p>
                                        <p> В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базах данных. Иногда споры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? или UUID?
                                  В Интернете полно догматических заповедей о том, как нужно выбирать и использовать
                                 ключи в реляционных базахры даже переходят в холивары: использовать естественные
                                  или искусственные ключи? Автоинкрементные целые или UUID?</p>",
                'created_at' => new Carbon(date("Y-m-d", time())),
            ]

        ];

        DB::table('articles')->insert($data);

    }
}
